cleanli2/stm32/src/cmd.c
#include "cmd.h"
#include "common.h"
#include "lprintf.h"
#include "sd/stm32_eval_spi_sd.h"
#include <stdint.h>
#include <string.h>
#include <display.h>
#define uint uint32_t
#define lprint lprintf

static char cmd_buf[COM_MAX_LEN] = "";
static uint cmd_buf_p = COM_MAX_LEN;
static uint quit_cmd = 0;
extern uint32_t task_mask;
extern uint32_t logv;

uint get_howmany_para(char *s);
char * str_to_str(char *s, char**result);
/*
void con_send(char X)
{
    __io_putchar(X);
    if(X == '\n'){
        __io_putchar('\r');
    }
}
*/
uint32_t ci=0;

uint8_t cmd_caches[CMD_CACHES_SIZE][COM_MAX_LEN] = {0};
uint32_t cmdcache_index=0;
uint32_t review_cmd_his_index;
uint8_t read_buf[512];

extern const uint8_t ziku12[];
extern const uint8_t ziku[];
uint32_t get_ziku12_size();
uint32_t get_ziku_size();
void w25f(char *p)
{
    uint32_t para1 = 0, para2=0, para3 = 0, tmp, cmdindex;
#ifdef WRITE_W25F
    const uint8_t*datawritebuf=ziku;
    uint32_t datalen = get_ziku_size();
#endif

    lprintf("p=%s\n", p);
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp>=1){
	    p = str_to_hex(p, &cmdindex);
    }
    if(tmp == 0 || cmdindex == 0){
        SD_LowLevel_Init();
        lprintf("w25 flash ID:%x\n", SPI_Flash_ReadID());
    }
    else if(cmdindex == 1){
        if(tmp>1){
            p = str_to_hex(p, &para1);
        }
        SPI_Flash_Read((uint8_t*)&para3, para1, 4);
        lprintf("w25 read 4 bytes = %X @%x\n", para3, para1);
    }
    else if(cmdindex == 2){//
        lprintf("w25f 2 addr data\n");
        if(tmp<3){
            goto err;
        }
        p = str_to_hex(p, &para1);//addr
        p = str_to_hex(p, &para2);//data
        SPI_Flash_Write((uint8_t*)&para2, para1, 4);
        lprintf("w25 write 4 bytes = %X @%x\n", para2, para1);
    }
    else if(cmdindex == 3){//
        if(tmp>1){
            p = str_to_hex(p, &para1);
        }
        para2 = 1;
        if(tmp>2){
            p = str_to_hex(p, &para2);
        }
        while(para2--){
            SPI_Flash_Read((uint8_t*)read_buf, para1, 512);
            mem_print((const char*)read_buf, para1, 512);
            para1+=512;
            lprintf("\n");
        }
    }
    else if(cmdindex == 4){//
        lprintf("erase all chip.\n");
        if(tmp<2){
            goto err;
        }
        p = str_to_hex(p, &para1);
        if(para1 != 0xe4a5ea11){
            lprintf("erase fail!");
        }
        else{
            SPI_Flash_Erase_Chip();
        }
    }
    else if(cmdindex == 5){//fake w w25f
#ifdef WRITE_W25F
        if(tmp>1){
            p = str_to_hex(p, &para1);
            lprintf("para1=%x, wbuf=0x%x, datalen=%d 0x%x\n", para1,
                    datawritebuf, datalen, datalen);
            //SPI_Flash_Write((uint8_t*)para1, datawritebuf, datalen);
        }
        else{
            lprintf("error para:w25f 5 70000//write to 0x70000");
        }
#endif
    }
    else if(cmdindex == 6){//cmd
        p = str_to_hex(p, &para1);
        p = str_to_hex(p, &para2);
        p = str_to_hex(p, &para3);
    }
    else if(cmdindex == 7){//w w25f
#ifdef WRITE_W25F
        if(tmp>2){
            p = str_to_hex(p, &para1);
            p = str_to_hex(p, &para2);
            lprintf("para1=%x, wbuf=0x%x, para2=%d\n", para1,
                    datawritebuf, datalen);
            SPI_Flash_Write(datawritebuf, para1, para2);
        }
        else{
            lprintf("error para:w25f 5 70000 18000//write to 0x70000, len 0x18000");
        }
#endif
    }
    else if(cmdindex == 8){//
        lprintf("erase one sector.\n");
        if(tmp<2){
            goto err;
        }
        p = str_to_hex(p, &para1);
        p = str_to_hex(p, &para2);
        if(para2 != 0xe4a5e07e){
            lprintf("erase %X fail", para1);
        }
        else{
            SPI_Flash_Erase_Sector(GET_SECTOR_ADDR(para1));
        }
    }
    else if(cmdindex == 0x9){//
        lprintf("switch env area\n");
        switch_env_area();
    }
    else if(cmdindex == 0xa){//
        lprintf("switch env area with data\n");
        p = str_to_hex(p, &para1);
        if(para1 != 0x5e14c6e7){
            lprintf("switch env fail", para1);
            goto err;
        }
        switch_env_area_with_data();
    }
    else if(cmdindex == 0xb){//
        lprintf("erase cur env area\n");
        p = str_to_hex(p, &para1);
        if(para1 != 0xe4a5ee7c){
            lprintf("erase env fail", para1);
        }
        else{
            erase_env_area();
        }
    }
    else if(cmdindex == 0xc){//
        lprintf("print log in spi flash:\n");
        spi_flash_log_print();
    }
    con_send('\n');

    return;
err:
    lprintf("ERROR para\n");
}

//u8 SD_Initialize(void);
#if 1
void sd(char *p)
{
    uint32_t para1 = 0, para2=0, para3 = 0, tmp, cmdindex;
    SD_Error Status = SD_OK;
    SD_CardInfo mycard;

    lprintf("p=%s\n", p);
    //strcpy(cmd_caches[ci++], p);
    if(ci > 40)
	    ci = 0;
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp>=1)
	    p = str_to_hex(p, &cmdindex);
    lprintf("cmdind=%d\n", cmdindex);
    if(tmp == 0 || cmdindex == 0){
	    lprintf("sd_init\n");
	    if((Status = SD_Init()) != SD_OK)
	    {
		    lprintf("Fail\n");
	    }
	    else{
		    lprintf("OK\n");
		    if((Status = SD_GetCardInfo(&mycard)) != SD_OK)
		    {
			    lprintf("get card info Fail\n");
		    }
		    else{
			    lprintf("block size %d\n", mycard.CardBlockSize);
			    lprintf("block capacity %d\n", mycard.CardCapacity);
		    }
	    }

	    //lprintf("sd_deinit\n");
	    //SD_DeInit();
    }
    else if(cmdindex == 1){//cs high/low
	lprintf("line %d\n", __LINE__);
        str_to_hex(p, &para1);
	if(para1)
		SD_CS_HIGH();
	else
		SD_CS_LOW();
    }
    else if(cmdindex == 2){//
	lprintf("line %d\n", __LINE__);
	SD_WriteByte(SD_DUMMY_BYTE);
    }
    else if(cmdindex == 3){//
        str_to_hex(p, &para1);
	lprintf("line %d para1 %x\n", __LINE__, para1);
	lprintf("read byte %x\n", SD_SPI_ReadWriteByte(para1));
    }
    else if(cmdindex == 4){//
	lprintf("SD_GetRes %x\n", SD_GetRes());
    }
    else if(cmdindex == 5){//cmd
	lprintf("line %d %x %x %x\n", __LINE__, para1, para2, para3);
        p = str_to_hex(p, &para1);
        p = str_to_hex(p, &para2);
        p = str_to_hex(p, &para3);
	SD_SendCmd(para1, para2, para3);
    }
    else if(cmdindex == 6){//cmd
    }
    else if(cmdindex == 7){//low init/deinit
        str_to_hex(p, &para1);
	lprintf("line %d para1 %x\n", __LINE__, para1);
	if(para1)
		SD_LowLevel_Init(); 
	else
		SD_LowLevel_DeInit();
    }
    else if(cmdindex == 8){//
	lprintf("do basic Init()\n");
	lprintf("SD_LowLevel_Init()\n");
	/*!< Initialize SD_SPI */
	SD_LowLevel_Init(); 

	/*!< SD chip select high */
	lprintf("SD_CS_HIGH()\n");
	SD_CS_HIGH();

	lprintf("send SD dummy bytes\n");
	/*!< Send dummy byte 0xFF, 10 times with CS high */
	/*!< Rise CS and MOSI for 80 clocks cycles */
	for (int i = 0; i <= 9; i++)
	{
		/*!< Send dummy byte 0xFF */
		SD_WriteByte(SD_DUMMY_BYTE);
	}
    }
    else if(cmdindex == 9){//
        str_to_hex(p, &para1);
	lprintf("line %d para1 %x\n", __LINE__, para1);
	lprintf("read byte %x\n", SD_ReadByte());
    }
    else if(cmdindex == 0xa){//
        lprintf("read sd block:sd a addr repeat\n");
        para1=0;
        para2=1;
        if(tmp>1){
            p = str_to_hex(p, &para1);
        }
        if(tmp>2){
            p = str_to_hex(p, &para2);
        }
        lprintf("addr %x\n", para1);
        lprintf("repeat %x\n", para2);
        while(para2--){
            SD_ReadBlock(read_buf, para1, 512);
            mem_print((const char*)read_buf, para1*512, 512);
            para1 += 1;
        }
    }
    else if(cmdindex == 0xb){//
        sf_read_id();
    }
    else if(cmdindex == 0xc){//
        str_to_hex(p, &para1);
        lprintf("spi choose %x\n", para1);
        spi_choose_stm32(para1);
    }
    else if(cmdindex == 0xd){//
        str_to_hex(p, &para1);
        lprintf("spi speed %x\n", para1);
        spi_speed(para1);
    }
    else if(cmdindex == 0xe){//
        lprintf("write sd block:sd e filldata blockaddr repeat\n");
        para1=0x55;
        para2=0x0;
        para3=1;
        if(tmp>1){
            p = str_to_hex(p, &para1);
        }
        if(tmp>2){
            p = str_to_hex(p, &para2);
        }
        if(tmp>3){
            p = str_to_hex(p, &para3);
        }
        lprintf("fill %x\n", para1);
        lprintf("blockaddr %x\n", para2);
        lprintf("dataaddr %W\n", ((uint64_t)para2)<<9);
        memset(read_buf, para1, 512);
        while(para3--){
            lprintf("write @%Wsd block ret:%x\n", ((uint64_t)para2)<<9,
                    SD_WriteBlock(read_buf, ((uint64_t)para2), 512));
            para2++;
        }
    }
    else if(cmdindex == 0xf){//
        //SD_Initialize();
    }
    con_send('\n');

    return;

