cleanli2/stm32/src/cmd.c
//error:
//    lprint("Err!\ndispcchar [x] [y]\n");
}
#if 0
void sd_cmds(char *p)
{
    uint tmp = get_howmany_para(p);
    uint para; 
    lprintf("tmp %x\n", tmp);
    if(tmp==0){
	    for(uint i =0;i<40;i++){
		    if(strlen(cmd_caches[i])>0){
			    lprintf("%d:%s\n", i, cmd_caches[i]);
		    }
	    }
    }
    else{
	    p = str_to_hex(p, &para);
	    lprintf("para %x\n", para);
	    switch(para){
		    case 0:
			    lprintf("clear cmd caches\n");
			    memset(*cmd_caches, 0, 1600);
			    ci = 0;
			    break;
		    case 1:
			    memset(cmd_caches[ci], 0, 40);
			    ci--;
			    break;
		    case 2:
			    for(uint i =0;i<40;i++){
				    if(strlen(cmd_caches[i])>0){
					    lprintf("%d:%s\n", cmd_caches[i]);
					    sd(cmd_caches[i]);
				    }
			    }
			    break;
		    default:
			    lprintf("do nothhing\n");
	    }
    }
    con_send('\n');

    return;
}
#endif
#endif

void lcdsuebinit(char *p)
{
    uint tmp = get_howmany_para(p);
    uint para = 0; 
    if(tmp>=1){
	    p = str_to_hex(p, &para);
    }
    lprintf("para %x\n", para);
    lcd_sueb_init(para);
    lcd_sueb_test();
    con_send('\n');

    return;

//error:
//    lprint("Err!\ndispcchar [x] [y]\n");
}

#if 0
void lcdsuebtest(char *p)
{
    (void)p;
    lcd_sueb_test();
    con_send('\n');

    return;

//error:
//    lprint("Err!\ndispcchar [x] [y]\n");
}

void lcd19264init(char *p)
{
  lcd_init();
  Display_Chinese2_12(0,0,ziku12+(0x18*2));//page 0, column 0
  Display_Chinese2_12(0,20,ziku12+(0x18*3));//page 0, column 20
  Display_Chinese_r90(0,40,lei1);//page 0, column 20
  /*
  Display_Chinese2(0,40,ziku);
  Display_Chinese2(0,60,ziku+0x20);
  Display_Chinese2(0,80,ziku+0x40);
  Display_Chinese2(0,100,ziku+0x60);
  Display_Chinese2(0,120,ziku+0x180);
  Display_Chinese2(0,140,ziku+0x1a0);
  Display_Chinese2(0,160,ziku+0x1b0);
  */
  for (int ti = 0;ti < 3;ti++){
      for(int tj = 0;tj < 12;tj++){
          Display_Chinese2((ti+1)*2,tj*16,ziku+(0x20*(ti*12+tj)));
      }
  }
    con_send('\n');

    return;

error:
    lprint("Err!\ndispcchar [x] [y]\n");
}
#endif

extern int led8s_debug;
void buzztest(char *p)
{
    uint para = 1, para1=2, tmp;

    tmp = get_howmany_para(p);
    if(tmp==0){
        led8s_debug=1-led8s_debug;
        lprintf("led8s_debug=%d\r\n", led8s_debug);
    }
    if(tmp>=1){
	    p = str_to_hex(p, &para);
    }
    if(tmp>=2){
	    p = str_to_hex(p, &para1);
    }
    lprintf("para 0x%x 0x%x\n", para, para1);

    if(para==0xf)
        lcd_lprintf(1, 0x10000,0,"015");
    else
        led8s_write(para, para1);

    con_send('\n');

    return;

//error:
//    lprint("Err!\ndispcchar [x] [y]\n");
}
void ledtest(char *p)
{
    uint para = 0, tmp;

    tmp = get_howmany_para(p);
    if( tmp >= 1){
	    p = str_to_hex(p, &para);
    }
    if(para){
	    /* Set*/
	    GPIO_ResetBits(GPIOA,GPIO_Pin_12);	
	    GPIO_ResetBits(GPIOA,GPIO_Pin_2);	
	    lprintf("\n\rSet\n\r");
    }
    else{
	    /* ReSet PC13 */
	    GPIO_SetBits(GPIOA,GPIO_Pin_12);	
	    GPIO_SetBits(GPIOA,GPIO_Pin_2);	
	    lprintf("\n\rClr\n\r");
    }
    con_send('\n');

    return;

//error:
//    lprint("Err!\ndispcchar [x] [y]\n");
}
#if 0
void dispcchar(char *p)
{
    uint x = 0, y=0, offset = 0, tmp;

    tmp = get_howmany_para(p);
    if( tmp < 2)
        goto error;
    p = str_to_hex(p, &x);
    p = str_to_hex(p, &y);
    if(tmp > 2)
        str_to_hex(p, &offset);
    lprintf("x=%d y=%d\n", x, y);
    if(tmp == 2)
        Display_Chinese(x,y,jiong1);
    else
        Display_Chinese2(x,y,ziku+offset);
    con_send('\n');

    return;

error:
    lprint("Err!\ndispcchar [x] [y]\n");
}

void dispwb(char *p)
{
    uint page = 0, cl=0, data = 0, tmp;

    tmp = get_howmany_para(p);
    if( tmp < 3)
        goto error;
    p = str_to_hex(p, &page);
    p = str_to_hex(p, &cl);
    str_to_hex(p, &data);
    page = page%4;
    cl = cl % 192;
    data &= 0xff;
    lprintf("page=%x cl=%x d=%x\n", page, cl, data);
    lcd_write_byte(page, cl, data);
    con_send('\n');

    return;

error:
    lprint("Err!\ndwb [page] [col] [data]\n");
}
void Display_Chinese2_fullscreen(uint32_t x, uint32_t y, uint32_t zi_offset)
{
    for(int i = 0; i <48; i++)
    {
        Display_Chinese2(x, y, ziku + 0x20*zi_offset++);
        y += 16;
        if(y>191){
            y = 0;
            x+=2;
        }
    }
}

void show_ziku(char *p)
{
    uint stt_off = 0, stp_off =0, tmp, zikusize;
    uint zi, x=0, y=0;

    zikusize = get_ziku_size();
    stp_off = zikusize;
    lprintf("size of ziku:%x %d\n", stp_off, stp_off);
    tmp = get_howmany_para(p);
    if( tmp > 0)
        p = str_to_hex(p, &stt_off);
    if( tmp > 1)
        p = str_to_hex(p, &stp_off);
    if(stp_off > zikusize)
        stp_off = zikusize;
    zi = stt_off;
    while(zi<stp_off){
        lprintf("zi %d stop %d\n", zi, stp_off);
        Display_Chinese2_fullscreen(x,y,zi);
        delay_ms(1000);
        zi+=12;
        if(con_is_recved())
            break;
    }
    con_send('\n');

    return;
}
void lcdsuebstep(char *p)
{
    uint32_t para1 = 0, para2=0, para3 = 0, para4 = 0, color = 0,tmp, cmdindex;
    uint32_t para5 = 0, para6=0, para7 = 0;

    lprintf("p=%s\n", p);
    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp>=1)
	    p = str_to_hex(p, &cmdindex);
    if(tmp == 0 || cmdindex == 0){
	    lprintf("lcd basic_init\n");
	    lcd_sueb_basicinit();
    }
    else if(cmdindex == 1){//cs high/low
	lprintf("line %d read reg %x\n", __LINE__, LCD_RD_REG());
    }
    else if(cmdindex == 2){//
	lprintf("line %d read data %x\n", __LINE__, LCD_RD_DATA());
    }
    else if(cmdindex == 3){//
	if (tmp<2)goto error;

        str_to_hex(p, &para1);
	lprintf("para1 %x\n", para1);
	LCD_WR_REG(para1);
	lprintf("line %d wr reg para1 %x\n", __LINE__);
    }
    else if(cmdindex == 4){//
	if (tmp<2)goto error;

        str_to_hex(p, &para1);
	lprintf("para1 %x\n", para1);
	lprintf("line %d wr data para1 %x\n", __LINE__);
	LCD_WR_DATA(para1);
    }
    else if(cmdindex == 5){//cmd
	if (tmp<5)goto error;
        p=str_to_hex(p, &para1);
        p=str_to_hex(p, &para2);
        p=str_to_hex(p, &para3);
        p=str_to_hex(p, &para4);
	if(tmp==6)
        p=str_to_hex(p, &color);
        Proxy_lcd_clr_window(color, para1, para2, para3, para4);
    }
    else if(cmdindex == 6){//cmd
	if (tmp<2)goto error;
        p=str_to_hex(p, &para1);
	lcd_sueb_init(para1);
    }
    else if(cmdindex == 7){
	if (tmp<7)goto error;
        p=str_to_hex(p, &para1);
        p=str_to_hex(p, &para2);
        p=str_to_hex(p, &para3);
        p=str_to_hex(p, &para4);
        p=str_to_hex(p, &para5);
        p=str_to_hex(p, &para6);
        p=str_to_hex(p, &para7);
	Show_Str(para1,para2,para3,para4,(char*)&para5,para6,para7, 1);
    }
    else if(cmdindex == 8){//
	    main_test(); 		//测试主界面
    }
    else if(cmdindex == 9){//
	    Test_Color();  		//简单刷屏填充测试
    }
    else if(cmdindex == 0xa){//
	    Test_FillRec();		//GUI矩形绘图测试
    }
    else if(cmdindex == 0xb){//
	    lprintf("test english font.Any key continue...\n");
	    English_Font_test();//英文字体示例测试
    }
    else if(cmdindex == 0xc){//
	    lprintf("test trigangle drawing.Any key continue...\n");
	    Test_Triangle();    //GUI三角形绘图测试
    }
    else if(cmdindex == 0xd){//
	    lprintf("test chinese font.Any key continue...\n");
	    Chinese_Font_test();//中文字体示例测试
    }
    else if(cmdindex == 0xe){//
	    lprintf("test pic display.Any key continue...\n");
	    Pic_test();			//图片显示示例测试
    }
    else if(cmdindex == 0xf){//
	    lprintf("test touch.\n");
	    //如果不带触摸，或者不需要触摸功能，请注释掉下面触摸屏测试项
	    Touch_Test();		//触摸屏手写测试		
    }
    else if(cmdindex == 0x10){//
	    lprintf("test rotate display.Any key continue...\n");
	    Rotate_Test();   //旋转显示测试
    }
    else if(cmdindex == 0x11){//
	    lprintf("test circle drawing.Any key continue...\n");
	    Test_Circle(); 		//GUI画圆测试
    }
    else if(cmdindex == 0x12){//
        if (tmp<2)goto error;
        p=str_to_hex(p, &para1);
        para1&=0xffff;
        lprintf("para1 %x\n", para1);
        set_BL_value(para1);
    }
    else if(cmdindex == 0x13){//
        set_touch_need_reinit();
    }
    else if(cmdindex == 0x14){//
        para1 = 100;
        if(tmp>0){
            p=str_to_hex(p, &para1);
        }
        while(para1--){
            uint16_t touch_x, touch_y;
            lprintf("ct%d\r", para1);
            if(get_TP_point(&touch_x, &touch_y)){
                lprintf("txy=%d,%d\n", (uint32_t)touch_x, (uint32_t)touch_y);
            }
            delay_ms(100);
        }
    }
    else if(cmdindex == 0x15){//
    }
    else if(cmdindex == 0x16){//
    }
    con_send('\n');

    return;

error:
    lprint("Err!\ndispcchar [x] [y]\n");
}
#endif
void poweroff(char *p)
{
    (void)p;
    lprintf("Power OFF!\n");
    power_off();
    con_send('\n');

    return;

