cleanli2/stm32/src/cmd.c
}
void rtcs(char *p)
{
    (void)p;
    con_send('\n');
    if(RTC_OK==adjust_1min(0)){
        lprintf("slower 1 min OK\n");
    }
    else{
        lprintf("slower 1 min FAIL\n");
    }
    return;
}
void rtcf(char *p)
{
    (void)p;
    con_send('\n');
    if(RTC_OK==adjust_1min(1)){
        lprintf("faster 1 min OK\n");
    }
    else{
        lprintf("faster 1 min FAIL\n");
    }
    return;
}
void gpiotest(char *p)
{
    (void)p;
    con_send('\n');
    gpio_test();

    return;

}
void ps(char *p)
{
    (void)p;
    lprintf("ps start:\n");
  if(os_is_running){
    while(!con_is_recved()){
        lprintf("===============\n");
        showtasks();
        os_ms_delay(1000);
    }
  }
  else{
    showtasks();
  }
    return;
}
void m_p(char *p)
{
    (void)p;
    uint32_t tmp, i=0;
    tmp = get_howmany_para(p);
    if(tmp>0){
        p = str_to_hex(p, &i);
    }
    play_music(music_lst[i], 0);
    return;
}
#if 0
struct point stress_pts[] = {
    {225, 305}
};
void stress(char *p)
{
    (void)p;
    u32 para_n, test_time, intv;
    para_n = get_howmany_para(p);
    if(para_n<=1){
        lprintf("please input test time minutes & touch interval\nstress min interval\n");
        return;
    }
    p = str_to_hex(p, &test_time);
    p = str_to_hex(p, &intv);
    gftp->pts = NULL;//disable currentt test
    gftp->n_pt = 1;
    gftp->cur_n_pt = 0;
    gftp->interval = intv;
    gftp->cur_interval = 0;
    gftp->last= test_time;
    gftp->start= g_ms_count;
    lprintf("##########stress test start %s\n", get_rtc_time(0));
    lprintf("##########stress touch interval 20*%d ms\n", gftp->interval);
    lprintf("##########stress test time long %d mins\n", gftp->last);
    gftp->pts = stress_pts;
    return;
}
#endif
extern char debug_log_buf[DEBUG_LOG_BUF_SIZE+1];
void bflog(char *p)
{
    (void)p;
    debug_log_buf[DEBUG_LOG_BUF_SIZE]=0;
    putchars(debug_log_buf);
    putchars("\n");
    return;
}
void rtc_cmd(char *p)
{
    uint8_t d[6], tmp;

    tmp = get_howmany_para(p);
    lprintf("tmp=%d\n", tmp);
    if(tmp==6){
        p = str_to_hex(p, (uint*)&d[0]);
        p = str_to_hex(p, (uint*)&d[1]);
        p = str_to_hex(p, (uint*)&d[2]);
        p = str_to_hex(p, (uint*)&d[3]);
        p = str_to_hex(p, (uint*)&d[4]);
        p = str_to_hex(p, (uint*)&d[5]);
        rtc_write(d);
        set_env("LastTimeAdj", get_rtc_time(NULL));
    }
    else if(tmp==0){
        lprintf("%s\n", get_rtc_time(0));
    }
    else if(tmp==1){
        p = str_to_hex(p, (uint*)&d[0]);
        lprintf("read reg %b=%b\n", d[0], rtc_read_reg(d[0]));
    }
    else if(tmp==2){
        p = str_to_hex(p, (uint*)&d[0]);
        p = str_to_hex(p, (uint*)&d[1]);
        lprintf("write reg %b->%b\n", d[0], d[1]);
        rtc_write_reg(d[0], d[1]);
    }
    else if(tmp==3){
        auto_time_correct_10s();
    }
    else{
        lprintf("error \n");
    }
    con_send('\n');

    return;

}
static const struct command cmd_list[]=
{
    //{"dwb",dispwb},
    {"adc",adc},
    {"bz",buzztest},
    {"bflog",bflog},
    {"exit",cmd_exit},
    {"envset",envset},
    {"envget",envget},
    {"envprint",envprint},
#ifndef WRITE_W25F
    {"fmerase",fmerase},
    {"fmrtest",fmrtest},
    {"fmwtest",fmwtest},
    {"go",go},
    {"gpiotest",gpiotest},
#endif
    {"help",print_help},
    {"history",history},
#ifndef WRITE_W25F
    //{"lcd19264init",lcd19264init},
    //{"lcd19264dc",dispcchar},
    {"kt",keytest},
    {"led",ledtest},
    {"logf",logflag},
    {"lst",lcdsuebinit},
    //{"lstep",lcdsuebstep},
    //{"lstest",lcdsuebtest},
    {"music",m_p},
#endif
    {"pm",print_mem},
    {"poff",poweroff},
    {"ps",ps},
    {"r",read_mem},
    {"reboot",reboot},
    {"rebootd",rebootd},
    {"rtc",rtc_cmd},
    {"rtcf",rtcf},
    {"rtcs",rtcs},
    {"sd",sd},
    //{"stress",stress},
#ifndef WRITE_W25F
    //{"sdcmds",sd_cmds},
    {"test",test},
    {"taskmask",tm},
    //{"szk",show_ziku},
    //{"usb",usb_strg_init},
#endif
    {"w",write_mem},
    {"w25f",w25f},
    {NULL, NULL},
};
static uint32_t * mrw_addr;
void go(char *para)
{
    (void)para;
	(*((void (*)())mrw_addr))();
}

void print_help(char *para)
{
    (void)para;
    uint i = 0;
    lprintf("Version %s%s\n", VERSION, GIT_SHA1);
    lprint("Cmd:\n");
    while(1){
            if(cmd_list[i].cmd_name == NULL)
                    break;
	    lprint("--%s\n", cmd_list[i].cmd_name);
            i++;
    }
}

uint asc_to_hex(char c)
{
	if(c >= '0' && c <= '9')
		return c - '0';	
	if(c >= 'A' && c <= 'F')
		return c - 'A' + 10;
	if(c >= 'a' && c <= 'f')
		return c - 'a' + 10;
	return 0;
}

uint get_howmany_para(char *s)
{
	uint tmp = 0;
	while(1){
		while(*s == ' ')
			s++;
		if(*s)
			tmp++;
		while(*s != ' ' && *s)
			s++;
		if(!*s)
			return tmp;
	}
}

char * str_to_str(char *s, char**result)
{
    while(*s == ' ')s++;
    *result=s;
    while(*s != ' ' && *s != 0)s++;
    if(*s==0){
        return NULL;
    }
    *s++=0;
    while(*s == ' ')s++;
    return s;
}

char * str_to_hex(char *s, uint32_t * result)
{
	uint  i = 0;

	*result = 0;
	while(*s == ' ')s++;
	for(i=0;i<8;i++){
		if(*s == ' ' || *s == 0)
			break;
		*result = *result*16 + asc_to_hex(*s++);
	}
	while(*s == ' ')s++;
	return s;
}

void print_mem(char *p)
{
    uint length = 0x80, tmp;
    char *cp;

    tmp = get_howmany_para(p);
    if( tmp > 1)
        goto error;
    if(tmp == 0)
        goto print;
    str_to_hex(p, &length);
print:
    cp = (char *)mrw_addr;
    mem_print(cp, (uint32_t)mrw_addr, length);

    return;

error:
    lprint("Err!\npm [length](0x80 default)\n");

}

void write_mem(char *p)
{
    uint value, tmp;

    tmp = get_howmany_para(p);
    if(tmp == 0 || tmp > 2)
	goto error;
    p = str_to_hex(p, &value);
    if(tmp == 1)
        goto write;
    str_to_hex(p, (uint32_t*)&mrw_addr);
    mrw_addr = (uint32_t*)((uint32_t)mrw_addr & 0xfffffffc);
write:
    *(uint32_t*)mrw_addr = value;
    lprint("Write 0x%x@0x%x\n",value,mrw_addr);
    return;

error:
    lprint("Err!\nw (hexaddr) [(hexaddr)](last addr default)\n");

